{
    "home": {
    "name": "Vinay Surisetty",
    "title": "MERN Stack Web Developer",
    "desc": "I am a MERN Stack Web Developer with 2 years of hands-on experience building responsive, user-centric applications. I specialize in creating modern front-end interfaces, secure back-end systems, and scalable full-stack solutions. Passionate about delivering clean code, seamless user experiences, and impactful digital products."
    },

    "about": {
    "aboutme1": "I’m Vinay, a dedicated MERN Stack Developer with strong experience in building fast, responsive, and dynamic web applications using React.js, Next.js, Node.js, Express.js, MongoDB, PostgreSQL, and modern tooling. I have successfully developed scalable RESTful APIs, optimized database structures, integrated authentication systems, and deployed production-ready applications on platforms like Vercel and Render.",
    
    "aboutme2": "Beyond full-stack development, I am exploring cloud technologies (AWS) and diving deeper into Web3 and blockchain development to expand my technical horizons. I enjoy solving real-world problems, contributing to impactful projects—including social service initiatives—and continuously improving my craft to deliver reliable, high-quality solutions.",
    
    "profile": "/assets/About/my-profile.png"
    },
      "skills" : [
        {
            "name" : "HTML",
            "image" :"/assets/skills/html.png"
        },
        {
            "name" : "CSS",
            "image" :"/assets/skills/css.png"
        },
        {
            "name" : "SASS",
            "image" :"/assets/skills/sass.png"
        },
        {
            "name" : "Tailwind",
            "image" :"/assets/skills/tailwind.png"
        },
        {
            "name" : "Material-UI",
            "image" :"/assets/skills/mui.png"
        },
        {
            "name" : "Javascript",
            "image" :"/assets/skills/javascript.png"
        },
        {
            "name" : "ReactJs",
            "image" :"/assets/skills/react.png"
        },
        {
            "name" : "Redux",
            "image" :"/assets/skills/Redux.png"
        },
        {
            "name" : "NextJs",
            "image" :"/assets/skills/nextjs.png"
        },
        {
            "name" : "NodeJs",
            "image" :"/assets/skills/node.png"
        },
        {
            "name" : "Express",
            "image" :"/assets/skills/express.png"
        },
        {
            "name" : "Mongodb",
            "image" :"/assets/skills/mongo.png"
        },
        {
            "name" : "MY-SQL",
            "image" :"/assets/skills/mysql.png"
        },
        {
            "name" : "Git",
            "image" :"/assets/skills/git.png"
        },
        {
            "name" : "GitHub",
            "image" :"/assets/skills/github1.png"
        }
    ],
    "projects": [
        {
            "id": "1",
            "name": "Chat-Application",
            "title": "React JS",
            "image": "/assets/projects/chat.png",
            "stack": "ReactJs/SASS",
            "url": "/project/1",
            "demo": "/demo/1",
            "desc":"I developed a Real-Time Chat Application using the MERN stack, designed for seamless communication across devices, similar to modern messaging platforms like WhatsApp. The app features real-time one-on-one and group chat functionality, powered by Socket.io for instant messaging and updates. Users can create groups, manage participants, and group admins have control over group settings. The frontend is built with React.js and styled using SCSS for a fully responsive, modern design across mobile, tablet, and desktop. To enhance performance, lazy loading is implemented to load chat messages only when needed, improving app speed and responsiveness. The backend, powered by Node.js and Express.js, handles APIs and real-time communication, while MongoDB stores user data and chat histories. The application also incorporates JWT-based authentication for secure login and session management. Additional features include a typing indicator and optimization for smooth performance on all devices.",
            "githubLink": "https://github.com/0xv1n4y/Realtime-Chat-Application",
            "technologies": ["ReactJs", "SCSS", "NodeJs", "ExpressJs", "MongoDB", "WebSockets", "JWT"]
        },
        {
            "id": "2",
            "name": "Ecommers-Application",
            "title": "React JS",
            "stack": "ReactJs/CSS",
            "image": "/assets/projects/ecommers.png",
            "url": "/project/2",
            "demo": "/demo/2",
            "desc":"I developed an e-commerce application focused on clothing, with a fully designed user interface. The frontend is built using React.js, styled with CSS and Material-UI to ensure a modern, responsive layout across devices. The project includes multiple pages designed for smooth navigation, allowing users to browse and interact with clothing items effortlessly. This UI-focused project emphasizes a clean and intuitive design, offering a great user experience for exploring the clothing products.",
            "githubLink": "https://github.com/0xv1n4y/dcCompars",
            "technologies": ["ReactJs", "CSS", "MaterialUI"]
        },
        {
            "id": "3",
            "name": "HTML Text Editor",
            "title": "React JS",
            "stack": "ReactJs/SASS",
            "image": "/assets/projects/TextEditor.png",
            "url": "/project/3",
            "demo": "/demo/3",
            "desc":"I recently developed a Live HTML Message Editor using React and React-Quill, designed to make message formatting intuitive and user-friendly. The editor includes features such as bold text, color customization, and text highlighting, enabling users to easily format their messages. As users type, the editor dynamically generates the corresponding HTML and displays it instantly in a live preview pane, allowing them to see the formatted output in real-time.",
            "githubLink": "https://github.com/0xv1n4y/HTML-Texteditor",
            "technologies": ["ReactJs", "SASS", "JavaScript", "MaterialUI"]
        },
        {
            "id": "4",
            "name": "Crypto-Tracker",
            "title": "React JS",
            "stack": "ReactJs",
            "image": "/assets/projects/crypto-world.png",
            "url": "/project/4",
            "demo": "/demo/4",
            "desc":"This web application fetches live cryptocurrency prices in both rupees and US dollars using the CoinGecko API. It displays real-time data, including rank, profit and loss, and integrates Chart.js for graphical representation. User authentication is implemented using Firebase, providing a secure and personalized experience.",
            "githubLink": "https://github.com/0xv1n4y/crypto-world",
            "technologies": ["ReactJs", "Firebase", "JWT"]
        }
    ],
    "contact":{
        "name":"Vinay Surisetty",
        "title":"MERN Stack Web Developer",
        "desc":"I am available for freelance or full-time positions. Contact me, and let's talk!",
        "image":"/assets/contact/contact.jpg"
    },
    "links" : {
        "linkedin" : "https://www.linkedin.com/in/vinaysurisetty/",
        "github" : "https://github.com/0xv1n4y/vinay",
        "mail" : "vinaysurisetty02@gmail.com",
        "phone" : "+916301355109"
    }
  }
  